# Pandas Cont.

In [1]:
import pandas as pd

#### 2. From a dictionary of ndarrays

In [2]:
import numpy as np

students = {"Name":np.array(['Alex','Bob','Dave']),"Age":np.array([10,12,13])}
pd.DataFrame(data=students)

   Name  Age
0  Alex   10
1   Bob   12
2  Dave   13

#### 3. From dictionary of series

In [5]:
students = {"Name":pd.Series(data = ['Alex','Bob','Dave']),"Age":pd.Series(data = [10,12,13])}
pd.DataFrame(students)

   Name  Age
0  Alex   10
1   Bob   12
2  Dave   13

In [6]:
#specifying index for series 
students = {"Name":pd.Series(data = ['Alex','Bob','Dave'],index=[100,101,102]),"Age":pd.Series(data = [10,12,13])}
pd.DataFrame(students)

     Name   Age
0     NaN  10.0
1     NaN  12.0
2     NaN  13.0
100  Alex   NaN
101   Bob   NaN
102  Dave   NaN

In [7]:
students = {"Name":pd.Series(data = ['Alex','Bob','Dave'],index=[100,101,102]),"Age":pd.Series(data = [10,12,13],index=[100,101,102])}
pd.DataFrame(students)

     Name  Age
100  Alex   10
101   Bob   12
102  Dave   13

In [12]:
students = {"Name":pd.Series(data = ['Alex','Bob','Dave','Ans'],index=[100,101,102,103]),"Age":pd.Series(data = [10,12,13],index=[100,101,102])}
pd.DataFrame(students)

     Name   Age
100  Alex  10.0
101   Bob  12.0
102  Dave  13.0
103   Ans   NaN

In [18]:
students = {"Name":pd.Series(data = ['Alex','Bob','Dave','Ans'],index=[100,101,102,103]),"Age":pd.Series(data = [10,12,13],index=[100,101,102])}
st = pd.DataFrame(data = students, index = [101,303,201,202,203])
st

    Name   Age
101  Bob  12.0
303  NaN   NaN
201  NaN   NaN
202  NaN   NaN
203  NaN   NaN

In [23]:
st[1]

KeyError: 1

## Different operations on pandas

In [25]:
df = pd.DataFrame(students)
df

     Name   Age
100  Alex  10.0
101   Bob  12.0
102  Dave  13.0
103   Ans   NaN

#### selecting columns

In [57]:
df['Name']  # gives columns

100    Alex
101     Bob
102    Dave
103     Ans
Name: Name, dtype: object

In [58]:
type (df['Name'])

pandas.core.series.Series

In [54]:
df['Age']

100    10.0
101    12.0
102    13.0
103     NaN
Name: Age, dtype: float64

In [55]:
print(df['Age'])

100    10.0
101    12.0
102    13.0
103     NaN
Name: Age, dtype: float64

In [28]:
type(df['Name'] )

pandas.core.series.Series

In [31]:
df[['Age','Name']]

      Age  Name
100  10.0  Alex
101  12.0   Bob
102  13.0  Dave
103   NaN   Ans

In [35]:
df[['Name','Age']]

     Name   Age
100  Alex  10.0
101   Bob  12.0
102  Dave  13.0
103   Ans   NaN

In [36]:
type(df[['Age','Name']])

pandas.core.frame.DataFrame

#### selecting rows
     loc (location) user index
     iloc (integer location) default index

In [43]:
# row index - label based
df.loc[101]

Name     Bob
Age     12.0
Name: 101, dtype: object

In [44]:
#integer postition based row index
df.iloc[0]

Name    Alex
Age     10.0
Name: 100, dtype: object

In [46]:
# multiple rows
df.loc[[100,102]]

     Name   Age
100  Alex  10.0
102  Dave  13.0

In [47]:
df.iloc[[1,3]]

    Name   Age
101  Bob  12.0
103  Ans   NaN

In [48]:
df.iloc[0,1] # 0 row 1 column

10.0

In [49]:
df.loc[100]['Age']

10.0

In [50]:
df.iloc[0]['Age']

10.0

In [51]:
df.iloc[0][0]

'Alex'

In [52]:
df.iloc[0,0]

'Alex'

### Column Addition

In [59]:
df

     Name   Age
100  Alex  10.0
101   Bob  12.0
102  Dave  13.0
103   Ans   NaN

In [62]:
df['Maths'] = pd.Series([35,34,55],index = (100,101,102))
df

     Name   Age  Maths
100  Alex  10.0   35.0
101   Bob  12.0   34.0
102  Dave  13.0   55.0
103   Ans   NaN    NaN

In [63]:
df['English'] = pd.Series([40,50,60],index = [100,101,102])
df

     Name   Age  Maths  English
100  Alex  10.0   35.0     40.0
101   Bob  12.0   34.0     50.0
102  Dave  13.0   55.0     60.0
103   Ans   NaN    NaN      NaN

In [65]:
df = df.drop(103)

KeyError: '[103] not found in axis'

In [66]:
df

     Name   Age  Maths  English
100  Alex  10.0   35.0     40.0
101   Bob  12.0   34.0     50.0
102  Dave  13.0   55.0     60.0

In [67]:
df['Science'] = [89,67,43]
df

     Name   Age  Maths  English  Science
100  Alex  10.0   35.0     40.0       89
101   Bob  12.0   34.0     50.0       67
102  Dave  13.0   55.0     60.0       43

In [69]:
df.insert(3,"IT",[45,89,65])
df

     Name   Age  Maths  IT  English  Science
100  Alex  10.0   35.0  45     40.0       89
101   Bob  12.0   34.0  89     50.0       67
102  Dave  13.0   55.0  65     60.0       43

In [70]:
df.insert(3,"Language",[45,89,65])
df

     Name   Age  Maths  Language  IT  English  Science
100  Alex  10.0   35.0        45  45     40.0       89
101   Bob  12.0   34.0        89  89     50.0       67
102  Dave  13.0   55.0        65  65     60.0       43

total column

In [73]:
df['Total'] = df['Maths']+df['IT']+df['Language']+df['English']+df['Science']
df

     Name   Age  Maths  Language  IT  English  Science  Total
100  Alex  10.0   35.0        45  45     40.0       89  254.0
101   Bob  12.0   34.0        89  89     50.0       67  329.0
102  Dave  13.0   55.0        65  65     60.0       43  288.0

### Remove columns

In [ ]:
df.pop('IT')
df

In [76]:
df['Total'] = df['Maths']+df['Language']+df['English']+df['Science']
df

     Name   Age  Maths  Language  English  Science  Total
100  Alex  10.0   35.0        45     40.0       89  209.0
101   Bob  12.0   34.0        89     50.0       67  240.0
102  Dave  13.0   55.0        65     60.0       43  223.0

In [77]:
del df['Total']
df

     Name   Age  Maths  Language  English  Science
100  Alex  10.0   35.0        45     40.0       89
101   Bob  12.0   34.0        89     50.0       67
102  Dave  13.0   55.0        65     60.0       43

In [78]:
df.drop('Language',axis=1)

     Name   Age  Maths  English  Science
100  Alex  10.0   35.0     40.0       89
101   Bob  12.0   34.0     50.0       67
102  Dave  13.0   55.0     60.0       43

In [79]:
df.drop(102)

     Name   Age  Maths  Language  English  Science
100  Alex  10.0   35.0        45     40.0       89
101   Bob  12.0   34.0        89     50.0       67

In [80]:
df

     Name   Age  Maths  Language  English  Science
100  Alex  10.0   35.0        45     40.0       89
101   Bob  12.0   34.0        89     50.0       67
102  Dave  13.0   55.0        65     60.0       43

In [82]:
df.drop('Language',axis=1,inplace=True)
df

     Name   Age  Maths  English  Science
100  Alex  10.0   35.0     40.0       89
101   Bob  12.0   34.0     50.0       67
102  Dave  13.0   55.0     60.0       43

### Adding new rows to DataFrame
#### 1. using loc

In [83]:
df.index

Int64Index([100, 101, 102], dtype='int64')

In [86]:
df.loc[len(df.index)] = ['Ans',13,40,50,50]
df

     Name   Age  Maths  English  Science
100  Alex  10.0   35.0     40.0       89
101   Bob  12.0   34.0     50.0       67
102  Dave  13.0   55.0     60.0       43
3     Ans  13.0   40.0     50.0       50

In [87]:
df.loc[103] = ['Ans',13,40,50,50]
df

     Name   Age  Maths  English  Science
100  Alex  10.0   35.0     40.0       89
101   Bob  12.0   34.0     50.0       67
102  Dave  13.0   55.0     60.0       43
3     Ans  13.0   40.0     50.0       50
103   Ans  13.0   40.0     50.0       50

In [97]:
df =df.append({"Name":"Jerry","Age":14,"Maths":43,"English":45,"Science":50},ignore_index=True)
df

C:\Users\ANSIL M B\AppData\Local\Temp\ipykernel_10820\2049607958.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df =df.append({"Name":"Jerry","Age":14,"Maths":43,"English":45,"Science":50},ignore_index=True)

    Name   Age  Maths  English  Science
0   Alex  10.0   35.0     40.0       89
1    Bob  12.0   34.0     50.0       67
2   Dave  13.0   55.0     60.0       43
3    Ans  13.0   40.0     50.0       50
4    Ans  13.0   40.0     50.0       50
5  Jerry  14.0   43.0     45.0       50

In [93]:
df

     Name   Age  Maths  English  Science
100  Alex  10.0   35.0     40.0       89
101   Bob  12.0   34.0     50.0       67
102  Dave  13.0   55.0     60.0       43
3     Ans  13.0   40.0     50.0       50
103   Ans  13.0   40.0     50.0       50

In [95]:
# another method

df2 = pd.DataFrame({'Name':['Sam','Tim'],'Age':[10,12],"Maths":[40,45],"English":[56,55],"Science":[60,50]})
df2

  Name  Age  Maths  English  Science
0  Sam   10     40       56       60
1  Tim   12     45       55       50

In [98]:
df3 = pd.concat([df,df2],ignore_index = True)
df3

    Name   Age  Maths  English  Science
0   Alex  10.0   35.0     40.0       89
1    Bob  12.0   34.0     50.0       67
2   Dave  13.0   55.0     60.0       43
3    Ans  13.0   40.0     50.0       50
4    Ans  13.0   40.0     50.0       50
5  Jerry  14.0   43.0     45.0       50
6    Sam  10.0   40.0     56.0       60
7    Tim  12.0   45.0     55.0       50

In [99]:
df3.loc[2] = ['Dave',12,40,50,60]
df3

    Name   Age  Maths  English  Science
0   Alex  10.0   35.0     40.0       89
1    Bob  12.0   34.0     50.0       67
2   Dave  12.0   40.0     50.0       60
3    Ans  13.0   40.0     50.0       50
4    Ans  13.0   40.0     50.0       50
5  Jerry  14.0   43.0     45.0       50
6    Sam  10.0   40.0     56.0       60
7    Tim  12.0   45.0     55.0       50

here index 2 replaced 
to avoid this

In [102]:
df3.loc[2.5] = ['Amy',13,40,45,50]
df3.sort_index()

      Name   Age  Maths  English  Science
0.0   Alex  10.0   35.0     40.0       89
1.0    Bob  12.0   34.0     50.0       67
2.0   Dave  12.0   40.0     50.0       60
2.5    Amy  13.0   40.0     45.0       50
3.0    Ans  13.0   40.0     50.0       50
4.0    Ans  13.0   40.0     50.0       50
5.0  Jerry  14.0   43.0     45.0       50
6.0    Sam  10.0   40.0     56.0       60
7.0    Tim  12.0   45.0     55.0       50

In [103]:
df3.loc[2.5] = ['Amy',13,40,45,50]
df3.sort_index().reset_index(drop = True)

    Name   Age  Maths  English  Science
0   Alex  10.0   35.0     40.0       89
1    Bob  12.0   34.0     50.0       67
2   Dave  12.0   40.0     50.0       60
3    Amy  13.0   40.0     45.0       50
4    Ans  13.0   40.0     50.0       50
5    Ans  13.0   40.0     50.0       50
6  Jerry  14.0   43.0     45.0       50
7    Sam  10.0   40.0     56.0       60
8    Tim  12.0   45.0     55.0       50

In [104]:
df3.loc[2.5] = ['Amy',13,40,45,50]
df3.reset_index(drop = True)

    Name   Age  Maths  English  Science
0   Alex  10.0   35.0     40.0       89
1    Bob  12.0   34.0     50.0       67
2   Dave  12.0   40.0     50.0       60
3    Ans  13.0   40.0     50.0       50
4    Ans  13.0   40.0     50.0       50
5  Jerry  14.0   43.0     45.0       50
6    Sam  10.0   40.0     56.0       60
7    Tim  12.0   45.0     55.0       50
8    Amy  13.0   40.0     45.0       50

In [105]:
df3.loc[2.5] = ['Amy',13,40,45,50]
df3.reset_index(drop = False)

   index   Name   Age  Maths  English  Science
0    0.0   Alex  10.0   35.0     40.0       89
1    1.0    Bob  12.0   34.0     50.0       67
2    2.0   Dave  12.0   40.0     50.0       60
3    3.0    Ans  13.0   40.0     50.0       50
4    4.0    Ans  13.0   40.0     50.0       50
5    5.0  Jerry  14.0   43.0     45.0       50
6    6.0    Sam  10.0   40.0     56.0       60
7    7.0    Tim  12.0   45.0     55.0       50
8    2.5    Amy  13.0   40.0     45.0       50

#### slicing rows

In [110]:
df = df3
df = df.reset_index(drop=True)
df

    Name   Age  Maths  English  Science
0   Alex  10.0   35.0     40.0       89
1    Bob  12.0   34.0     50.0       67
2   Dave  12.0   40.0     50.0       60
3    Ans  13.0   40.0     50.0       50
4    Ans  13.0   40.0     50.0       50
5  Jerry  14.0   43.0     45.0       50
6    Sam  10.0   40.0     56.0       60
7    Tim  12.0   45.0     55.0       50
8    Amy  13.0   40.0     45.0       50

In [111]:
df[1:3]

   Name   Age  Maths  English  Science
1   Bob  12.0   34.0     50.0       67
2  Dave  12.0   40.0     50.0       60

In [112]:
df[::-1]

    Name   Age  Maths  English  Science
8    Amy  13.0   40.0     45.0       50
7    Tim  12.0   45.0     55.0       50
6    Sam  10.0   40.0     56.0       60
5  Jerry  14.0   43.0     45.0       50
4    Ans  13.0   40.0     50.0       50
3    Ans  13.0   40.0     50.0       50
2   Dave  12.0   40.0     50.0       60
1    Bob  12.0   34.0     50.0       67
0   Alex  10.0   35.0     40.0       89

In [113]:
df.loc[3:6]

    Name   Age  Maths  English  Science
3    Ans  13.0   40.0     50.0       50
4    Ans  13.0   40.0     50.0       50
5  Jerry  14.0   43.0     45.0       50
6    Sam  10.0   40.0     56.0       60

In [114]:
df[3:]

    Name   Age  Maths  English  Science
3    Ans  13.0   40.0     50.0       50
4    Ans  13.0   40.0     50.0       50
5  Jerry  14.0   43.0     45.0       50
6    Sam  10.0   40.0     56.0       60
7    Tim  12.0   45.0     55.0       50
8    Amy  13.0   40.0     45.0       50

In [116]:
df.iloc[:4]

   Name   Age  Maths  English  Science
0  Alex  10.0   35.0     40.0       89
1   Bob  12.0   34.0     50.0       67
2  Dave  12.0   40.0     50.0       60
3   Ans  13.0   40.0     50.0       50